---
kind: other
id: Properties.T:Autodesk.Revit.DB.Visual.AssetPropertyFloatArray
source: html/0135a07f-04ec-46d5-42de-f3d16a34ba6e.htm
---
# AssetPropertyFloatArray Properties

Identifies if the object is read-only or modifiable.
 If true, the object may not be modified. If false, the object's contents may be modified.